*** src/main.rs:115:9: replace <impl Deserializer for Point>::deserialize -> Result<Self, String> with Ok(Default::default())

*** mutation diff:
--- src/main.rs
+++ replace <impl Deserializer for Point>::deserialize -> Result<Self, String> with Ok(Default::default())
@@ -107,39 +107,17 @@
         point.insert("y", JsonValue::Number(self.y.into()));
 
         point
     }
 }
 
 impl Deserializer<Object> for Point {
     fn deserialize(document: &Object) -> Result<Self, String> {
-        let mut point = Point { x: 0.0, y: 0.0 };
-
-        if let Some(x) = document.get("x") {
-            if let JsonValue::Number(x) = x {
-                point.x = From::from(*x);
-            } else {
-                return Err("Field x needs to be a number in point object".into());
-            }
-        } else {
-            return Err("Field x needs to be in point object.".into());
-        }
-
-        if let Some(y) = document.get("y") {
-            if let JsonValue::Number(y) = y {
-                point.y = From::from(*y);
-            } else {
-                return Err("Field y needs to be a number in point object".into());
-            }
-        } else {
-            return Err("Field y needs to be in point object.".into());
-        }
-
-        Ok(point)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Default)]
 struct Pencil {
     start: Point,
     offsets: Vec<Point>,
 }

---- mutants::tests::tests::test_1 stdout ----
1
thread 'mutants::tests::tests::test_1' panicked at src\main.rs:58:9:
assertion `left == right` failed
  left: start: x: 10, y: 4.6
offsets: [x: 2.4, y: 3, x: 3.6, y: 1.4]
 right: start: x: 0, y: 0
offsets: [x: 0, y: 0, x: 0, y: 0]

failures:
    mutants::tests::tests::test_1

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
