*** src/main.rs:116:9: replace <impl PartialEq for Pencil>::eq -> bool with true

*** mutation diff:
--- src/main.rs
+++ replace <impl PartialEq for Pencil>::eq -> bool with true
@@ -108,22 +108,17 @@
 struct Pencil {
     start: Point,
     offsets: Vec<Point>,
 }
 
 impl PartialEq for Pencil
 {
     fn eq(&self, other: &Self) -> bool {
-        (self.start == other.start) && (self.offsets.len() == other.offsets.len()) &&
-            self.offsets.iter().zip(other.offsets.iter()).fold(
-                true,
-                |result, (point_1, point_2)|
-                    result && (*point_1 == *point_2)
-            )
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Display for Pencil
 {
     fn fmt(&self, f: &mut Formatter<'_>) -> std::fmt::Result {
         f.write_fmt(format_args!("start: {}\noffsets: {:?}", self.start, self.offsets))
     }

*** result: Success
