*** src/main.rs:116:9: replace <impl PartialEq for Pencil>::eq -> bool with false

*** mutation diff:
--- src/main.rs
+++ replace <impl PartialEq for Pencil>::eq -> bool with false
@@ -108,22 +108,17 @@
 struct Pencil {
     start: Point,
     offsets: Vec<Point>,
 }
 
 impl PartialEq for Pencil
 {
     fn eq(&self, other: &Self) -> bool {
-        (self.start == other.start) && (self.offsets.len() == other.offsets.len()) &&
-            self.offsets.iter().zip(other.offsets.iter()).fold(
-                true,
-                |result, (point_1, point_2)|
-                    result && (*point_1 == *point_2)
-            )
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Display for Pencil
 {
     fn fmt(&self, f: &mut Formatter<'_>) -> std::fmt::Result {
         f.write_fmt(format_args!("start: {}\noffsets: {:?}", self.start, self.offsets))
     }

---- functional::boundary::tests::tests::test_1 stdout ----
thread 'functional::boundary::tests::tests::test_1' panicked at src\main.rs:27:5:
assertion `left == right` failed
  left: start: x: 5, y: 2
offsets: []
 right: start: x: 5, y: 2
offsets: []

failures:
    functional::boundary::tests::tests::test_1

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
