*** src/main.rs:120:41: replace == with != in <impl PartialEq for Pencil>::eq

*** mutation diff:
--- src/main.rs
+++ replace == with != in <impl PartialEq for Pencil>::eq
@@ -112,17 +112,17 @@
 
 impl PartialEq for Pencil
 {
     fn eq(&self, other: &Self) -> bool {
         (self.start == other.start) && (self.offsets.len() == other.offsets.len()) &&
             self.offsets.iter().zip(other.offsets.iter()).fold(
                 true,
                 |result, (point_1, point_2)|
-                    result && (*point_1 == *point_2)
+                    result && (*point_1 != /* ~ changed by cargo-mutants ~ */ *point_2)
             )
     }
 }
 
 impl Display for Pencil
 {
     fn fmt(&self, f: &mut Formatter<'_>) -> std::fmt::Result {
         f.write_fmt(format_args!("start: {}\noffsets: {:?}", self.start, self.offsets))

*** result: Success
