*** src/main.rs:150:84: replace && with || in <impl PartialEq for Pencil>::eq

*** mutation diff:
--- src/main.rs
+++ replace && with || in <impl PartialEq for Pencil>::eq
@@ -142,17 +142,17 @@
 struct Pencil {
     start: Point,
     offsets: Vec<Point>,
 }
 
 impl PartialEq for Pencil
 {
     fn eq(&self, other: &Self) -> bool {
-        (self.start == other.start) && (self.offsets.len() == other.offsets.len()) &&
+        (self.start == other.start) && (self.offsets.len() == other.offsets.len()) || /* ~ changed by cargo-mutants ~ */
             self.offsets.iter().zip(other.offsets.iter()).fold(
                 true,
                 |result, (point_1, point_2)|
                     result && (*point_1 == *point_2)
             )
     }
 }

*** result: Success
