*** src/main.rs:162:9: replace <impl Display for Pencil>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- src/main.rs
+++ replace <impl Display for Pencil>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -154,17 +154,17 @@
                     result && (*point_1 == *point_2)
             )
     }
 }
 
 impl Display for Pencil
 {
     fn fmt(&self, f: &mut Formatter<'_>) -> std::fmt::Result {
-        f.write_fmt(format_args!("start: {}\noffsets: {:?}", self.start, self.offsets))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Debug for Pencil
 {
     fn fmt(&self, f: &mut Formatter<'_>) -> std::fmt::Result {
         Display::fmt(self, f)
     }

*** result: Success
