*** src/main.rs:16:5: replace test with ()

*** mutation diff:
--- src/main.rs
+++ replace test with ()
@@ -8,30 +8,17 @@
 fn main() {
 
 }
 
 fn test(pencil: Pencil)
 {
     //fs::write("./src/functional/equivalence/test_1.json", json::stringify(JsonValue::Object(pencil.serialize()))).unwrap();
 
-    let path = env::var("path").unwrap();
-    let json = json::parse(std::str::from_utf8(fs::read(path).unwrap().as_slice()).unwrap()).unwrap();
-
-    let pencil_end :Result<Pencil, String>= if let JsonValue::Object(object) = json {
-        Deserializer::deserialize(&object)
-    } else {
-        Err("The pencil needs to be a json object.".into())
-    };
-
-    let pencil_end = pencil_end.unwrap();
-
-    assert_eq!(pencil, pencil_end);
-
-    println!("{}", pencil_end);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 trait Serializer<T> {
     fn serialize(&self) -> T;
 }
 
 trait Deserializer<T> {
     fn deserialize(document: &T) -> Result<Self, String> where Self:Sized;

*** result: Success
