*** src/main.rs:48:40: replace == with != in <impl PartialEq for Point>::eq

*** mutation diff:
--- src/main.rs
+++ replace == with != in <impl PartialEq for Point>::eq
@@ -40,17 +40,17 @@
 #[derive(Default, Clone)]
 struct Point {
     x: f32,
     y: f32,
 }
 
 impl PartialEq for Point {
     fn eq(&self, other: &Self) -> bool {
-        (self.x == other.x) && (self.y == other.y)
+        (self.x == other.x) && (self.y != /* ~ changed by cargo-mutants ~ */ other.y)
     }
 }
 
 impl Eq for Point {}
 
 impl Display for Point
 {
     fn fmt(&self, f: &mut Formatter<'_>) -> std::fmt::Result {

---- functional::boundary::tests::tests::test_1 stdout ----
thread 'functional::boundary::tests::tests::test_1' panicked at src\main.rs:27:5:
assertion `left == right` failed
  left: start: x: 5, y: 2
offsets: []
 right: start: x: 5, y: 2
offsets: []

failures:
    functional::boundary::tests::tests::test_1

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
