*** src/main.rs:57:9: replace <impl Display for Point>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- src/main.rs
+++ replace <impl Display for Point>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -49,17 +49,17 @@
     }
 }
 
 impl Eq for Point {}
 
 impl Display for Point
 {
     fn fmt(&self, f: &mut Formatter<'_>) -> std::fmt::Result {
-        f.write_fmt(format_args!("x: {}, y: {}", self.x, self.y))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Debug for Point
 {
     fn fmt(&self, f: &mut Formatter<'_>) -> std::fmt::Result {
         Display::fmt(self, f)
     }

*** result: Success
