*** src/main.rs:82:29: replace && with || in <impl PartialEq for Point>::eq

*** mutation diff:
--- src/main.rs
+++ replace && with || in <impl PartialEq for Point>::eq
@@ -74,17 +74,17 @@
 #[derive(Default, Clone)]
 struct Point {
     x: f32,
     y: f32,
 }
 
 impl PartialEq for Point {
     fn eq(&self, other: &Self) -> bool {
-        (self.x == other.x) && (self.y == other.y)
+        (self.x == other.x) || /* ~ changed by cargo-mutants ~ */ (self.y == other.y)
     }
 }
 
 impl Eq for Point {}
 
 impl Display for Point
 {
     fn fmt(&self, f: &mut Formatter<'_>) -> std::fmt::Result {

*** result: Success
