*** src/main.rs:148:37: replace && with || in <impl PartialEq for Pencil>::eq

*** mutation diff:
--- src/main.rs
+++ replace && with || in <impl PartialEq for Pencil>::eq
@@ -140,17 +140,17 @@
 struct Pencil {
     start: Point,
     offsets: Vec<Point>,
 }
 
 impl PartialEq for Pencil
 {
     fn eq(&self, other: &Self) -> bool {
-        (self.start == other.start) && (self.offsets.len() == other.offsets.len()) &&
+        (self.start == other.start) || /* ~ changed by cargo-mutants ~ */ (self.offsets.len() == other.offsets.len()) &&
             self.offsets.iter().zip(other.offsets.iter()).fold(
                 true,
                 |result, (point_1, point_2)|
                     result && (*point_1 == *point_2)
             )
     }
 }

---- mutants::tests::tests::test_3 stdout ----
start: x: 10, y: 4.6
offsets: [x: 2.4, y: 3, x: 3.6, y: 1.5]
note: test did not panic as expected

---- mutants::tests::tests::test_2 stdout ----
start: x: 10, y: 4.6
offsets: [x: 2.5, y: 3, x: 3.6, y: 1.4]
note: test did not panic as expected

failures:
    mutants::tests::tests::test_2
    mutants::tests::tests::test_3

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
