*** src/main.rs:152:28: replace && with || in <impl PartialEq for Pencil>::eq

*** mutation diff:
--- src/main.rs
+++ replace && with || in <impl PartialEq for Pencil>::eq
@@ -144,17 +144,17 @@
 
 impl PartialEq for Pencil
 {
     fn eq(&self, other: &Self) -> bool {
         (self.start == other.start) && (self.offsets.len() == other.offsets.len()) &&
             self.offsets.iter().zip(other.offsets.iter()).fold(
                 true,
                 |result, (point_1, point_2)|
-                    result && (*point_1 == *point_2)
+                    result || /* ~ changed by cargo-mutants ~ */ (*point_1 == *point_2)
             )
     }
 }
 
 impl Display for Pencil
 {
     fn fmt(&self, f: &mut Formatter<'_>) -> std::fmt::Result {
         f.write_fmt(format_args!("start: {}\noffsets: {:?}", self.start, self.offsets))

---- mutants::tests::tests::test_2 stdout ----
start: x: 10, y: 4.6
offsets: [x: 2.5, y: 3, x: 3.6, y: 1.4]
note: test did not panic as expected

---- mutants::tests::tests::test_3 stdout ----
start: x: 10, y: 4.6
offsets: [x: 2.4, y: 3, x: 3.6, y: 1.5]
note: test did not panic as expected

failures:
    mutants::tests::tests::test_2
    mutants::tests::tests::test_3

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
