*** src/main.rs:38:5: replace test with ()

*** mutation diff:
--- src/main.rs
+++ replace test with ()
@@ -30,40 +30,17 @@
 
     assert!(paths.next().is_none(), "There should only be {} paths.", n);
 }
 
 fn test(pencil: Pencil)
 {
     //fs::write("./src/functional/equivalence/test_1.json", json::stringify(JsonValue::Object(pencil.serialize()))).unwrap();
 
-    let n :i32= env::var("n").unwrap().parse().unwrap();
-    assert!(n > 0, "N needs to be greater than 0.");
-
-    let binding = env::var("paths").unwrap();
-    let mut paths = binding.split(",");
-
-    for _ in 0..n {
-        let path = paths.next().expect(&*format!("There should be {} paths.", n));
-        let json = json::parse(std::str::from_utf8(fs::read(path).unwrap().as_slice()).unwrap()).unwrap();
-
-        let pencil_end :Result<Pencil, String>= if let JsonValue::Object(object) = json {
-            Deserializer::deserialize(&object)
-        } else {
-            Err("The pencil needs to be a json object.".into())
-        };
-
-        let pencil_end = pencil_end.unwrap();
-
-        assert_eq!(pencil, pencil_end);
-
-        println!("{}", pencil_end);
-    }
-
-    assert!(paths.next().is_none(), "There should only be {} paths.", n);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 trait Serializer<T> {
     fn serialize(&self) -> T;
 }
 
 trait Deserializer<T> {
     fn deserialize(document: &T) -> Result<Self, String> where Self:Sized;

---- mutants::tests::tests::test_2 stdout ----
note: test did not panic as expected

---- mutants::tests::tests::test_3 stdout ----
note: test did not panic as expected

failures:
    mutants::tests::tests::test_2
    mutants::tests::tests::test_3

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
