*** src/main.rs:80:9: replace <impl PartialEq for Point>::eq -> bool with true

*** mutation diff:
--- src/main.rs
+++ replace <impl PartialEq for Point>::eq -> bool with true
@@ -72,17 +72,17 @@
 #[derive(Default, Clone)]
 struct Point {
     x: f32,
     y: f32,
 }
 
 impl PartialEq for Point {
     fn eq(&self, other: &Self) -> bool {
-        (self.x == other.x) && (self.y == other.y)
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Eq for Point {}
 
 impl Display for Point
 {
     fn fmt(&self, f: &mut Formatter<'_>) -> std::fmt::Result {

---- mutants::tests::tests::test_3 stdout ----
start: x: 10, y: 4.6
offsets: [x: 2.4, y: 3, x: 3.6, y: 1.5]
note: test did not panic as expected

---- mutants::tests::tests::test_2 stdout ----
start: x: 10, y: 4.6
offsets: [x: 2.5, y: 3, x: 3.6, y: 1.4]
note: test did not panic as expected

failures:
    mutants::tests::tests::test_2
    mutants::tests::tests::test_3

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
