*** src/main.rs:96:9: replace <impl Debug for Point>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- src/main.rs
+++ replace <impl Debug for Point>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -88,17 +88,17 @@
     fn fmt(&self, f: &mut Formatter<'_>) -> std::fmt::Result {
         f.write_fmt(format_args!("x: {}, y: {}", self.x, self.y))
     }
 }
 
 impl Debug for Point
 {
     fn fmt(&self, f: &mut Formatter<'_>) -> std::fmt::Result {
-        Display::fmt(self, f)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Serializer<Object> for Point {
     fn serialize(&self) -> Object {
         let mut point = Object::new();
 
         point.insert("x", JsonValue::Number(self.x.into()));

---- mutants::tests::tests::test_1 stdout ----
thread 'mutants::tests::tests::test_1' panicked at src\main.rs:56:9:
assertion `left == right` failed
  left: start: x: 10, y: 4.6
offsets: [, ]
 right: start: x: 10, y: 4.6
offsets: [, ]

failures:
    mutants::tests::tests::test_1

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
